#+TITLE: Resumo2
** Fatores

+ Os fatores podem ser armazenados de forma muito eficiente com fácil verificação de dados – se se tentaratribuir um valor a um fator que não está incluído numa das suas categorias ou níveis (levels), o Rautomaticamente gera um aviso.
    #+begin_src R
    corCabelo<-factor(c("azul","castanho","amarelo","verde","azul","amarelo"))
    table(corCabelo)
    #+end_src

    #+RESULTS:
    | amarelo  | 2 |
    | azul     | 2 |
    | castanho | 1 |
    | verde    | 1 |

+ Quando os dados são ordinais, não basta passar o argumento "ordered" com a flag TRUE, pois a ordem lexicografica é assumida por defeito.

    #+begin_src R
    corCabelo<-factor(c("azul","castanho","amarelo","verde","azul","amarelo"),ordered=T)
    corCabelo
    #+end_src

    #+RESULTS:
|[1]| azul    | castanho |amarelo | verde |   azul |    amarelo|
: Levels: amarelo < azul < castanho < verde

*** Definir um data.frame
#+begin_src R
nomesI<-letters[1:5]
nomesF<-LETTERS[22:26]

numA<-sample(1:20,5)
numB<-sample(1:20,5)
numC<-sample(1:20,5)

my_df<-data.frame(varA=nomesI,varB=nomesF,colA=numA,colB=numB,colC=numC)
#+end_src

#+RESULTS:
|   | varA | varB | colA | colB | colC |
| 1 | a    | V    |    7 |    2 |    2 |
| 2 | b    | W    |   13 |   16 |   15 |
| 3 | c    | X    |    5 |   15 |    5 |
| 4 | d    | Y    |   16 |    3 |   16 |
| 5 | e    | Z    |    6 |    6 |   20 |
